using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Learning_C_basics_App
{
    public static partial class Program
    {
        // Что такое класс. ООП. Что такое объект класса. Экземпляр класса
        private static void Lesson_051()
        {
            Console.WriteLine("Hello from Lesson_051  Что такое класс. ООП. Что такое объект класса. Экземпляр класса");
            Console.WriteLine();

            //Класс - это шаблон или чертеж для создания объектов. Он определяет свойства и методы,
            //которые объекты этого класса будут иметь.
            //ООП (Объектно-ориентированное программирование) - это парадигма программирования,
            //которая использует объекты и классы для организации кода и данных.
            //Объект класса - это конкретный экземпляр класса, который имеет свои собственные значения свойств
            //и может выполнять методы, определенные в классе.
            //Экземпляр класса - это термин, который используется для обозначения конкретного объекта,
            //созданного на основе класса.

            Console.WriteLine(new string('-', 120));
        }
    }
}
